Revit 2026 API

# ViewSheetGetRevisionCloudNumberOnSheet Method

---

Gets the Revision Number for a RevisionCloud on this sheet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetRevisionCloudNumberOnSheet(
	ElementId revisionCloudId
)
```
```vb
Public Function GetRevisionCloudNumberOnSheet (
	revisionCloudId As ElementId
) As String
```
```cpp
public:
String^ GetRevisionCloudNumberOnSheet(
	ElementId^ revisionCloudId
)
```
```fsharp
member GetRevisionCloudNumberOnSheet :
        revisionCloudId : ElementId -> string
```

#### Parameters

revisionCloudId ElementId
     The id of the RevisionCLoud.

#### Return Value

String Returns the Revision Number as it will appear on this sheet or  if there is no Revision Number assigned on this sheet.

| Exception | Condition |
| --- | --- |
| ArgumentException | revisionCloudId is not the Id of a RevisionCloud. |
| ArgumentNullException | A non-optional argument was null |

Returns  if the RevisionCloud or its associated Revision do not appear on this sheet. The Revision Number for a RevisionCloud will always be the same as the Revision Number of the associated Revision.

#### Reference

ViewSheet Class

Autodesk.Revit.DB Namespace